
var city = [
  {
    title:"热门城市",
    type:'hot',
    item: [

      {
        "name": "北京市",
        "key": "热门",
        "test":"testValue",
        "code": "110100000000"
      },
      {
        "name": "上海市",
        "key": "热门",
        "code": "310100000000"
      },
      {
        "name": "广州市",
        "key": "热门",
        "code": "440100000000"
      },
      {
        "name": "深圳市",
        "key": "热门",
        "code": "440300000000"
      },
      {
        "name": "成都市",
        "code": "510100000000",
        "key": "热门"
      },

      {
        "name": "重庆市",
        "code": "500100000000",
        "key": "热门"
      },
      {
        "name": "天津市",
        "code": "120100000000",
        "key": "热门"
      },
      {
        "name": "杭州市",
        "code": "330100000000",
        "key": "热门"
      },
      {
        "name": "南京市",
        "code": "320100000000",
        "key": "热门"
      },
      {
        "name": "苏州市",
        "code": "320500000000",
        "key": "热门"
      },
      {
        "name": "武汉市",
        "code": "420100000000",
        "key": "热门"
      },

      {
        "name": "西安市",
        "code": "610100000000",
        "key": "热门"
      }

    ]
  }, {
    title:"A",
    item: [
      {
        "name": "阿坝自治州",
        "code": "513200000000",
        "key": "A"
      },
      {
        "name": "阿拉善盟",
        "code": "152900000000",
        "key": "A"
      },
      {
        "name": "阿里地区",
        "code": "542500000000",
        "key": "A"
      },
      {
        "name": "安康市",
        "code": "610900000000",
        "key": "A"
      },
      {
        "name": "安庆市",
        "code": "340800000000",
        "key": "A"
      },

      {
        "name": "鞍山市",
        "code": "210300000000",
        "key": "A"
      }
      ,
      {
        "name": "安顺市",
        "code": "520400000000",
        "key": "A"
      }
      ,
      {
        "name": "安阳市",
        "code": "410500000000",
        "key": "A"
      }
      ,
      {
        "name": "澳门",
        "code": "820100000000",
        "key": "A"
      }
    ]
  }, {
    title: "B",
    item: [
      {
        "name": "北京市",
        "code": "110100000000",
        "key": "B"
      },
      {
        "name": "白银市",
        "code": "620400000000",
        "key": "B"
      },
      {
        "name": "保定市",
        "code": "130600000000",
        "key": "B"
      },
      {
        "name": "宝鸡市",
        "code": "610300000000",
        "key": "B"
      },
      {
        "name": "保山市",
        "code": "530500000000",
        "key": "B"
      },
      {
        "name": "包头市",
        "code": "150200000000",
        "key": "B"
      },
      {
        "name": "巴中市",
        "code": "511900000000",
        "key": "B"
      }
      ,
      {
        "name": "北海市",
        "code": "450500000000",
        "key": "B"
      }
      ,
      {
        "name": "蚌埠市",
        "code": "340300000000",
        "key": "B"
      }
      ,
      {
        "name": "本溪市",
        "code": "210500000000",
        "key": "B"
      }
      ,
      {
        "name": "毕节市",
        "code": "520500000000",
        "key": "B"
      }
      ,
      {
        "name": "滨州市",
        "code": "371600000000",
        "key": "B"
      }
      ,
      {
        "name": "百色市",
        "code": "451000000000",
        "key": "B"
      }
      ,
      {
        "name": "亳州市",
        "code": "341600000000",
        "key": "B"
      }
    ]
  }, {
    title: "C",
    item: [
      {
        "name": "重庆市",
        "code": "500100000000",
        "key": "C"
      },
      {
        "name": "成都市",
        "code": "510100000000",
        "key": "C"
      },
      {
        "name": "长沙市",
        "code": "430100000000",
        "key": "C"
      },
      {
        "name": "长春市",
        "code": "220100000000",
        "key": "C"
      },
      {
        "name": "沧州市",
        "code": "130900000000",
        "key": "C"
      },
      {
        "name": "常德市",
        "code": "430700000000",
        "key": "C"
      },
      {
        "name": "昌都市",
        "code": "540300000000",
        "key": "C"
      }
      ,
      {
        "name": "长治市",
        "code": "140400000000",
        "key": "C"
      }
      ,
      {
        "name": "常州市",
        "code": "320400000000",
        "key": "C"
      }
      ,
      // {
      //   "name": "巢湖",
      //   "key": "C"
      // }
      // ,
      {
        "name": "潮州市",
        "code": "445100000000",
        "key": "C"
      }
      ,
      {
        "name": "承德市",
        "code": "130800000000",
        "key": "C"
      }
      ,
      {
        "name": "郴州市",
        "code": "431000000000",
        "key": "C"
      }
      ,
      {
        "name": "赤峰市",
        "code": "150400000000",
        "key": "C"
      }
      ,
      {
        "name": "池州市",
        "code": "341700000000",
        "key": "C"
      }
      ,
      {
        "name": "崇左市",
        "code": "451400000000",
        "key": "C"
      }
      ,
      {
        "name": "楚雄自治州",
        "code": "532300000000",
        "key": "C"
      }
      ,
      {
        "name": "滁州市",
        "code": "341100000000",
        "key": "C"
      }
      ,
      {
        "name": "朝阳市",
        "code": "211300000000",
        "key": "C"
      }
    ]
  }, {
    title: "D",
    item: [
      {
        "name": "大连市",
        "code": "210200000000",
        "key": "D"
      },
      {
        "name": "东莞市",
        "code": "441900000000",
        "key": "D"
      },
      {
        "name": "大理自治州",
        "code": "532900000000",
        "key": "D"
      },
      {
        "name": "丹东市",
        "code": "210600000000",
        "key": "D"
      },
      {
        "name": "大庆市",
        "code": "230600000000",
        "key": "D"
      },
      {
        "name": "大同市",
        "code": "140200000000",
        "key": "D"
      },
      {
        "name": "大兴安岭",
        "code": "232700000000",
        "key": "D"
      }
      ,
      {
        "name": "德宏自治州",
        "code": "533100000000",
        "key": "D"
      }
      ,
      {
        "name": "德阳市",
        "code": "510600000000",
        "key": "D"
      }
      ,
      {
        "name": "德州市",
        "code": "371400000000",
        "key": "D"
      }
      ,
      {
        "name": "定西市",
        "code": "621100000000",
        "key": "D"
      }
      ,
      {
        "name": "迪庆自治州",
        "code": "533400000000",
        "key": "D"
      }
      ,
      {
        "name": "东营市",
        "code": "370500000000",
        "key": "D"
      }

    ]
  }, {
    title: "E",
    item: [
      {
        "name": "鄂尔多斯市",
        "code": "150600000000",
        "key": "E"
      }
      ,
      {
        "name": "恩施自治州",
        "code": "422800000000",
        "key": "E"
      }
      ,
      {
        "name": "鄂州市",
        "code": "420700000000",
        "key": "E"
      }
    ]
  }, {
    title: "F",
    item: [
      {
        "name": "福州市",
        "code": "350100000000",
        "key": "F"
      }
      ,
      {
        "name": "防城港市",
        "code": "450600000000",
        "key": "F"
      }
      ,
      {
        "name": "佛山市",
        "code": "440600000000",
        "key": "F"
      }
      ,
      {
        "name": "抚顺市",
        "code": "210400000000",
        "key": "F"
      }
      ,
      {
        "name": "抚州市",
        "code": "361000000000",
        "key": "F"
      }
      ,
      {
        "name": "阜新市",
        "code": "210900000000",
        "key": "F"
      }
      ,
      {
        "name": "阜阳市",
        "code": "341200000000",
        "key": "F"
      }
    ]
  }, {
    title: "G",
    item: [
      {
        "name": "广州市",
        "code": "440100000000",
        "key": "G"
      },
      {
        "name": "赣州市",
        "code": "360700000000",
        "key": "G"
      },
      {
        "name": "桂林市",
        "code": "450300000000",
        "key": "G"
      },
      {
        "name": "贵阳市",
        "code": "520100000000",
        "key": "G"
      },
      {
        "name": "甘南自治州",
        "code": "623000000000",
        "key": "G"
      },

      {
        "name": "甘孜自治州",
        "code": "513300000000",
        "key": "G"
      },
      {
        "name": "广安市",
        "code": "511600000000",
        "key": "G"
      }
      ,
      {
        "name": "广元市",
        "code": "510800000000",
        "key": "G"
      }
      ,
      {
        "name": "果洛自治州",
        "code": "632600000000",
        "key": "G"
      }
      ,
      {
        "name": "贵港市",
        "code": "450800000000",
        "key": "G"
      }

    ]
  }, {

    title: "H",
    item: [
      {
        "name": "杭州市",
        "code": "330100000000",
        "key": "H"
      },
      {
        "name": "哈尔滨市",
        "code": "230100000000",
        "key": "H"
      },
      {
        "name": "合肥市",
        "code": "340100000000",
        "key": "H"
      },
      {
        "name": "海口市",
        "code": "460100000000",
        "key": "H"
      },
      {
        "name": "海东市",
        "code": "630200000000",
        "key": "H"
      },
      {
        "name": "海北自治州",
        "code": "632200000000",
        "key": "H"
      },
      {
        "name": "海南自治州",
        "code": "632500000000",
        "key": "H"
      }
      ,
      {
        "name": "海西自治州",
        "code": "632800000000",
        "key": "H"
      }
      ,
      {
        "name": "邯郸市",
        "code": "130400000000",
        "key": "H"
      }

      ,
      {
        "name": "汉中市",
        "code": "610700000000",
        "key": "H"
      }
      ,
      {
        "name": "鹤壁市",
        "code": "410600000000",
        "key": "H"
      }
      ,
      {
        "name": "河池市",
        "code": "451200000000",
        "key": "H"
      }
      ,
      {
        "name": "鹤岗市",
        "code": "230400000000",
        "key": "H"
      }
      ,
      {
        "name": "黑河市",
        "code": "231100000000",
        "key": "H"
      }
      ,
      {
        "name": "衡水市",
        "code": "131100000000",
        "key": "H"
      }
      ,
      {
        "name": "衡阳市",
        "code": "430400000000",
        "key": "H"
      }

      ,
      {
        "name": "河源市",
        "code": "441600000000",
        "key": "H"
      }
      ,
      {
        "name": "贺州市",
        "code": "451100000000",
        "key": "H"
      }
      ,
      {
        "name": "红河自治州",
        "code": "532500000000",
        "key": "H"
      }
      ,
      {
        "name": "淮安市",
        "code": "320800000000",
        "key": "H"
      }
      ,
      {
        "name": "淮北市",
        "code": "340600000000",
        "key": "H"
      }
      ,
      {
        "name": "怀化市",
        "code": "431200000000",
        "key": "H"
      }
      ,
      {
        "name": "淮南市",
        "code": "340400000000",
        "key": "H"
      }
      ,

      {
        "name": "黄冈市",
        "code": "421100000000",
        "key": "H"
      }
      ,
      {
        "name": "黄南自治州",
        "code": "632300000000",
        "key": "H"
      }
      ,
      {
        "name": "黄山市",
        "code": "341000000000",
        "key": "H"
      },
      {
        "name": "黄石市",
        "code": "420200000000",
        "key": "H"
      },
      {
        "name": "惠州市",
        "code": "441300000000",
        "key": "H"
      },
      {
        "name": "葫芦岛市",
        "code": "211400000000",
        "key": "H"
      },
      {
        "name": "呼伦贝尔市",
        "code": "150700000000",
        "key": "H"
      },
      {
        "name": "湖州市",
        "code": "330500000000",
        "key": "H"
      }
      ,
      {
        "name": "菏泽市",
        "code": "371700000000",
        "key": "H"
      }

    ]
  }, {
    title: "J",
    item: [

      {
        "name": "济南市",
        "code": "370100000000",
        "key": "J"
      },
      {
        "name": "佳木斯市",
        "code": "230800000000",
        "key": "J"
      },
      {
        "name": "吉安市",
        "code": "360800000000",
        "key": "J"
      },
      {
        "name": "江门市",
        "code": "440700000000",
        "key": "J"
      },
      {
        "name": "焦作市",
        "code": "410800000000",
        "key": "J"
      },
      {
        "name": "嘉兴市",
        "code": "330400000000",
        "key": "J"
      },
      {
        "name": "嘉峪关市",
        "code": "620200000000",
        "key": "J"
      }
      ,
      {
        "name": "揭阳市",
        "code": "445200000000",
        "key": "J"
      }
      ,

      {
        "name": "吉林市",
        "code": "220200000000",
        "key": "J"
      }
      ,
      {
        "name": "金昌市",
        "code": "620300000000",
        "key": "J"
      }
      ,
      {
        "name": "晋城市",
        "code": "140500000000",
        "key": "J"
      }
      ,
      {
        "name": "景德镇市",
        "code": "360200000000",
        "key": "J"
      }
      ,
      {
        "name": "荆门市",
        "code": "420800000000",
        "key": "J"
      }
      ,
      {
        "name": "荆州市",
        "code": "421000000000",
        "key": "J"
      }
      ,
      {
        "name": "金华市",
        "code": "330700000000",
        "key": "J"
      }

      ,
      {
        "name": "济宁市",
        "code": "370800000000",
        "key": "J"
      }
      ,
      {
        "name": "晋中市",
        "code": "140700000000",
        "key": "J"
      }
      ,
      {
        "name": "锦州市",
        "code": "210700000000",
        "key": "J"
      }
      ,
      {
        "name": "九江市",
        "code": "360400000000",
        "key": "J"
      }
      ,
      {
        "name": "酒泉市",
        "code": "620900000000",
        "key": "J"
      }
    ]
  }, {
    title: "K",
    item: [
      {
        "name": "昆明市",
        "code": "530100000000",
        "key": "K"

      }
      ,
      {

        "name": "开封市",
        "code": "410200000000",
        "key": "K"
      }
    ]
  }, {

    title: "L",
    item:[
      {
        "name": "兰州市",
        "code": "620100000000",
        "key": "L"
      },
      {
        "name": "拉萨市",
        "code": "540100000000",
        "key": "L"
      },
      {
        "name": "来宾市",
        "code": "451300000000",
        "key": "L"
      },
      {
        "name": "莱芜市",
        "code": "371200000000",
        "key": "L"
      },
      {
        "name": "廊坊市",
        "code": "131000000000",
        "key": "L"
      },
      {
        "name": "乐山市",
        "code": "511100000000",
        "key": "L"
      },
      {
        "name": "凉山自治州",
        "code": "513400000000",
        "key": "L"
      }
      ,
      {
        "name": "连云港市",
        "code": "320700000000",
        "key": "L"
      }

      ,
      {
        "name": "聊城市",
        "code": "371500000000",
        "key": "L"
      }

      ,
      {
        "name": "辽阳市",
        "code": "211000000000",
        "key": "L"
      }
      ,
      {
        "name": "辽源市",
        "code": "220400000000",
        "key": "L"
      }
      ,
      {
        "name": "丽江市",
        "code": "530700000000"
      }
      ,
      {
        "name": "临沧市",
        "code": "530900000000",
        "key": "L"
      }
      ,
      {
        "name": "临汾市",
        "code": "141000000000",
        "key": "L"
      }
      ,
      {
        "name": "临夏自治州",
        "code": "622900000000",
        "key": "L"
      }
      ,

      {
        "name": "临沂市",
        "code": "371300000000",
        "key": "L"
      }

      ,
      {
        "name": "林芝市",
        "code": "540400000000",
        "key": "L"
      }
      ,
      {
        "name": "丽水市",
        "code": "331100000000",
        "key": "L"
      }
      ,
      {
        "name": "六安市",
        "code": "341500000000",
        "key": "L"
      }
      ,
      {
        "name": "六盘水市",
        "code": "520200000000",
        "key": "L"
      }
      ,
      {
        "name": "柳州市",
        "code": "450200000000",
        "key": "L"
      }
      ,
      {
        "name": "陇南市",
        "code": "621200000000",
        "key": "L"
      }
      ,

      {
        "name": "龙岩市",
        "code": "350800000000",
        "key": "L"
      }
      ,

      {
        "name": "娄底市",
        "code": "431300000000",
        "key": "L"
      }
      ,
      {
        "name": "漯河市",
        "code": "411100000000",
        "key": "L"
      }
      ,
      {
        "name": "洛阳市",
        "code": "410300000000",
        "key": "L"
      },
      {
        "name": "泸州市",
        "code": "510500000000",
        "key": "L"
      },
      {
        "name": "吕梁市",
        "code": "141100000000",
        "key": "L"
      }

    ]
  }, {

    title: "M",
    item: [
      {
        "name": "马鞍山市",
        "code": "340500000000",
        "key": "M"
      }
      ,
      {
        "name": "茂名市",
        "code": "440900000000",
        "key": "M"
      }
      ,
      {
        "name": "眉山市",
        "code": "511400000000",
        "key": "M"
      }
      ,
      {
        "name": "梅州市",
        "code": "441400000000",
        "key": "M"
      }
      ,
      {
        "name": "绵阳市",
        "code": "510700000000",
        "key": "M"
      }
      ,
      {
        "name": "牡丹江市",
        "code": "231000000000",
        "key": "M"
      }

    ]
  }, {
    title: "N",
    item: [

      {
        "name": "南京市",
        "code": "320100000000",
        "key": "N"
      },
      {
        "name": "南昌市",
        "code": "360100000000",
        "key": "N"
      },
      {
        "name": "南宁市",
        "code": "450100000000",
        "key": "N"
      },
      {
        "name": "南充市",
        "code": "511300000000",
        "key": "N"
      },
      {
        "name": "南平市",
        "code": "350700000000",
        "key": "N"
      },
      {
        "name": "南通市",
        "code": "320600000000",
        "key": "N"
      },
      {
        "name": "南阳市",
        "code": "411300000000",
        "key": "N"
      }
      ,
      {
        "name": "那曲地区",
        "code": "542400000000",
        "key": "N"
      }

      ,
      {
        "name": "内江市",
        "code": "511000000000",
        "key": "N"
      }
      ,
      {
        "name": "宁德市",
        "code": "350900000000",
        "key": "N"
      }
      ,
      {
        "name": "怒江自治州",
        "code": "533300000000",
        "key": "N"
      }


    ]
  }, {
    title: "P",
    item: [

      {
        "name": "盘锦市",
        "code": "211100000000",
        "key": "P"
      }
      ,
      {
        "name": "攀枝花市",
        "code": "510400000000",
        "key": "P"
      }
      ,
      {
        "name": "平顶山市",
        "code": "410400000000",
        "key": "P"
      }
      ,
      {
        "name": "平凉市",
        "code": "620800000000",
        "key": "P"
      }
      ,
      {
        "name": "萍乡市",
        "code":"36030000000",
        "key": "P"
      }
      ,
      {
        "name": "莆田市",
        "code": "350300000000",
        "key": "P"
      }
      ,
      {
        "name": "濮阳市",
        "code": "410900000000",
        "key": "P"
      }

    ]
  }, {
    title: "Q",
    item:[

      {
        "name": "青岛市",
        "code": "370200000000",
        "key": "Q"
      },
      {
        "name": "黔东南",
        "code": "522600000000",
        "key": "Q"
      },
      {
        "name": "黔南自治州",
        "code": "522700000000",
        "key": "Q"
      },
      {
        "name": "黔西南",
        "code": "522300000000",
        "key": "Q"
      },
      {
        "name": "庆阳市",
        "code": "621000000000",
        "key": "Q"
      },
      {
        "name": "清远市",
        "code": "441800000000",
        "key": "Q"
      },
      {
        "name": "秦皇岛市",
        "code": "130300000000",
        "key": "Q"
      }
      ,
      {
        "name": "钦州市",
        "code": "450700000000",
        "key": "Q"
      }
      ,
      {
        "name": "齐齐哈尔市",
        "code": "230200000000",
        "key": "Q"
      }
      ,
      {
        "name": "泉州市",
        "code": "350500000000",
        "key": "Q"
      }
      ,
      {
        "name": "曲靖市",
        "code": "530300000000",
        "key": "Q"
      }
      ,
      {
        "name": "衢州市",
        "code": "330800000000",
        "key": "Q"
      }


    ]
  }, {

    title: "R",
    item: [
      {
        "name": "日喀则市",
        "code": "540200000000",
        "key": "R"
      },
      {
        "name": "日照市",
        "code": "371100000000",
        "key": "R"
      }
    ]
  }, {

    title: "S",
    item:[
      {
        "name": "上海市",
        "code": "310100000000",
        "key": "S"
      },
      {
        "name": "深圳市",
        "code": "440300000000",
        "key": "S"
      },
      {
        "name": "苏州市",
        "code": "320500000000",
        "key": "S"
      },
      {
        "name": "沈阳市",
        "code": "210100000000",
        "key": "S"
      },
      {
        "name": "石家庄市",
        "code": "130100000000",
        "key": "S"
      },
      {
        "name": "三门峡市",
        "code": "411200000000",
        "key": "S"
      },
      {
        "name": "三明市",
        "code": "350400000000",
        "key": "S"
      }
      ,
      {
        "name": "三亚市",
        "code": "460200000000",
        "key": "S"
      }

      ,
      {
        "name": "商洛市",
        "code": "611000000000",
        "key": "S"
      }

      ,
      {
        "name": "商丘市",
        "code": "411400000000",
        "key": "S"
      }
      ,
      {
        "name": "上饶市",
        "code": "361100000000",
        "key": "S"
      }
      ,
      {
        "name": "山南市",
        "code": "540500000000",
        "key": "S"
      }
      ,
      {
        "name": "汕头市",
        "code": "440500000000",
        "key": "S"
      }
      ,
      {
        "name": "汕尾市",
        "code": "441500000000",
        "key": "S"
      }
      ,
      {
        "name": "韶关市",
        "code": "440200000000",
        "key": "S"
      }
      ,

      {
        "name": "绍兴市",
        "code": "330600000000",
        "key": "S"
      }

      ,
      {
        "name": "邵阳市",
        "code": "430500000000",
        "key": "S"
      }
      ,
      {
        "name": "十堰市",
        "code": "420300000000",
        "key": "S"
      }
      ,
      {
        "name": "朔州市",
        "code": "140600000000",
        "key": "S"
      }
      ,
      {
        "name": "四平市",
        "code": "220300000000",
        "key": "S"
      }
      ,
      {
        "name": "绥化市",
        "code": "231200000000",
        "key": "S"
      }
      ,
      {
        "name": "遂宁市",
        "code": "510900000000",
        "key": "S"
      }
      ,

      {
        "name": "随州市",
        "code": "421300000000",
        "key": "S"
      }
      ,

      {
        "name": "娄底市",
        "code": "431300000000",
        "key": "S"
      }
      ,
      {
        "name": "宿迁市",
        "code": "321300000000",
        "key": "S"
      }
      ,
      {
        "name": "宿州市",
        "code": "341300000000",
        "key": "S"
      }

    ]
  }, {
    title: "T",
    item: [

      {
        "name": "天津市",
        "code": "120100000000",
        "key": "T"
      },
      {
        "name": "太原市",
        "code": "140100000000",
        "key": "T"
      },
      {
        "name": "泰安市",
        "code": "370900000000",
        "key": "T"
      },
      {
        "name": "泰州市",
        "code": "321200000000",
        "key": "T"
      },
      {
        "name": "唐山市",
        "code": "130200000000",
        "key": "T"
      },
      {
        "name": "天水市",
        "code": "620500000000",
        "key": "T"
      },
      {
        "name": "铁岭市",
        "code": "211200000000",
        "key": "T"
      }
      ,
      {
        "name": "铜川市",
        "code": "610200000000",
        "key": "T"
      }
      ,

      {
        "name": "通化市",
        "code": "220500000000",
        "key": "T"
      }
      ,
      {
        "name": "通辽市",
        "code": "150500000000",
        "key": "T"
      }
      ,
      {
        "name": "铜陵市",
        "code": "340700000000",
        "key": "T"
      }
      ,
      {
        "name": "铜仁市",
        "code": "520600000000",
        "key": "T"
      }
      ,
      {
        "name": "台湾",
        "code": "710100000000",
        "key": "T"
      }


    ]
  }, {
    title: "W",
    item: [

      {
        "name": "武汉市",
        "code": "420100000000",
        "key": "W"
      },
      {
        "name": "乌鲁木齐市",
        "code": "650100000000",
        "key": "W"
      },
      {
        "name": "无锡市",
        "code": "320200000000",
        "key": "W"
      },
      {
        "name": "威海市",
        "code": "371000000000",
        "key": "W"
      },
      {
        "name": "潍坊市",
        "code": "370700000000",
        "key": "W"
      },
      {
        "name": "文山自治州",
        "code": "532600000000",
        "key": "W"
      },
      {
        "name": "温州市",
        "code": "330300000000",
        "key": "W"
      }
      ,
      {
        "name": "乌海市",
        "code": "150300000000",
        "key": "W"
      }
      ,

      {
        "name": "芜湖市",
        "code": "340200000000",
        "key": "W"
      }
      ,
      {
        "name": "乌兰察布市",
        "code": "150900000000",
        "key": "W"
      }
      ,
      {
        "name": "武威市",
        "code": "620600000000",
        "key": "W"
      }
      ,
      {
        "name": "梧州市",
        "code": "450400000000",
        "key": "W"
      }

    ]
  }, {
    title: "X",
    item: [

      {
        "name": "厦门市",
        "code": "350200000000",
        "key": "X"
      },
      {
        "name": "西安市",
        "code": "610100000000",
        "key": "X"
      },
      {
        "name": "西宁市",
        "code": "630100000000",
        "key": "X"
      },
      // {
      //   "name": "襄樊",
      //   "key": "X"
      // },
      {
        "name": "湘潭市",
        "code": "430300000000"
      },
      {
        "name": "湘西自治州",
        "code": "433100000000",
        "key": "X"
      },
      {
        "name": "咸宁市",
        "code": "421200000000",
        "key": "X"
      }
      ,
      {
        "name": "咸阳市",
        "code": "610400000000",
        "key": "X"
      }
      ,

      {
        "name": "孝感市",
        "code": "420900000000",
        "key": "X"
      }
      ,
      {
        "name": "邢台市",
        "code": "130500000000",
        "key": "X"
      }
      ,
      {
        "name": "新乡市",
        "code": "410700000000",
        "key": "X"
      }
      ,
      {
        "name": "信阳市",
        "code": "411500000000",
        "key": "X"
      }
      ,
      {
        "name": "新余市",
        "code": "360500000000",
        "key": "X"
      }
      ,
      {
        "name": "忻州市",
        "code": "140900000000",
        "key": "X"
      }
      ,
      {
        "name": "西双版纳",
        "code": "532800000000",
        "key": "X"
      }

      ,
      {
        "name": "宣城市",
        "code": "341800000000",
        "key": "X"
      }
      ,

      {
        "name": "许昌市",
        "code": "411000000000",
        "key": "X"
      }
      ,
      {
        "name": "徐州市",
        "code": "320300000000",
        "key": "X"
      }
      ,
      {
        "name": "香港",
        "code": "810100000000",
        "key": "X"
      }
      ,
      {
        "name": "锡林郭勒盟",
        "code": "152500000000",
        "key": "X"
      }
      ,
      {
        "name": "兴安盟",
        "code": "152200000000",
        "key": "X"
      }
    ]
  }, {
    title: "Y",
    item: [

      {
        "name": "银川市",
        "code": "640100000000",
        "key": "Y"
      },
      {
        "name": "雅安市",
        "code": "511800000000",
        "key": "Y"
      },
      {
        "name": "延安市",
        "code": "610600000000",
        "key": "Y"
      },
      {
        "name": "延边自治州",
        "code": "222400000000",
        "key": "Y"
      },
      {
        "name": "盐城市",
        "code": "320900000000",
        "key": "Y"
      },
      {
        "name": "阳江市",
        "code": "441700000000",
        "key": "Y"
      },

      {
        "name": "阳泉市",
        "code": "140300000000",
        "key": "Y"
      }
      ,
      {
        "name": "扬州市",
        "code": "321000000000",
        "key": "Y"
      }
      ,

      {
        "name": "烟台市",
        "code": "370600000000",
        "key": "Y"
      }
      ,
      {
        "name": "宜宾市",
        "code": "511500000000",
        "key": "Y"
      }
      ,
      {
        "name": "宜昌市",
        "code": "420500000000",
        "key": "Y"
      }
      ,
      {
        "name": "宜春市",
        "code": "360900000000",
        "key": "Y"
      }
      ,
      {
        "name": "营口市",
        "code": "210800000000",
        "key": "Y"
      }
      ,

      {
        "name": "益阳市",
        "code": "430900000000",
        "key": "Y"
      }
      ,
      {
        "name": "永州市",
        "code": "431100000000",
        "key": "Y"
      }

      ,
      {
        "name": "岳阳市",
        "code": "430600000000",
        "key": "Y"
      }
      ,

      {
        "name": "榆林市",
        "code": "610800000000",
        "key": "Y"
      }
      ,
      {
        "name": "运城市",
        "code": "140800000000",
        "key": "Y"
      }
      ,
      {
        "name": "云浮市",
        "code": "445300000000",
        "key": "Y"
      }
      ,
      {
        "name": "玉树自治州",
        "code": "632700000000",
        "key": "Y"
      }
      ,
      {
        "name": "玉溪市",
        "code": "530400000000",
        "key": "Y"
      }
      ,
      {
        "name": "玉林市",
        "code": "450900000000",
        "key": "Y"
      }

    ]
  }, {

    title: "Z",
    item: [
      // {
      //   "name": "杂多县",
      //   "key": "Z"
      // },
      // {
      //   "name": "赞皇县",
      //   "key": "Z"
      // },
      // {
      //   "name": "枣强县",
      //   "key": "Z"
      // },
      // {
      //   "name": "枣阳市",
      //   "key": "Z"
      // },

      {
        "name": "珠海市",
        "code": "440400000000",
        "key": "Z"
      },
      {
        "name": "枣庄市",
        "code": "370400000000",
        "key": "Z"
      },
      // {
      //   "name": "泽库县",
      //   "key": "Z"
      // },
      // {
      //   "name": "增城市",
      //   "key": "Z"
      // }
      // ,

      // {
      //   "name": "曾都区",
      //   "key": "Z"
      // }
      // ,
      // {
      //   "name": "泽普县",
      //   "key": "Z"
      // }
      //  ,
      // {
      //   "name": "泽州县",
      //   "key": "Z"
      // }
      // ,
      // {
      //   "name": "札达县",
      //   "key": "Z"
      // }
      // ,
      // {
      //   "name": "扎赉特旗",
      //   "key": "Z"
      // }
      // ,
      // {
      //   "name": "扎兰屯市",
      //   "key": "Z"
      // }
      // ,
      // {
      //   "name": "扎鲁特旗",
      //   "key": "Z"
      // }
      // ,

      // {
      //   "name": "扎囊县",
      //   "key": "Z"
      // }
      // ,
      // {
      //   "name": "张北县",
      //   "key": "Z"
      // }

      // ,
      // {
      //   "name": "张店区",
      //   "key": "Z"
      // }
      // ,
      // {
      //   "name": "章贡区",
      //   "key": "Z"
      // }
      // ,
      // {
      //   "name": "张家港",
      //   "key": "Z"
      // }
      // ,
      {
        "name": "张家界市",
        "code": "430800000000",
        "key": "Z"
      }
      ,
      {
        "name": "张家口市",
        "code": "130700000000",
        "key": "Z"
      }
      ,
      // {
      //   "name": "漳平市",
      //   "key": "Z"
      // }
      // ,

      // {
      //   "name": "漳浦县",
      //   "key": "Z"
      // }
      // ,

      // {
      //   "name": "章丘市",
      //   "key": "Z"
      // }
      // ,
      // {
      //   "name": "樟树市",
      //   "key": "Z"
      // }
      // ,
      // {
      //   "name": "张湾区",
      //   "key": "Z"
      // },
      // {
      //   "name": "彰武县",
      //   "key": "Z"
      // },
      // {
      //   "name": "漳县",
      //   "key": "Z"
      // },
      {
        "name": "张掖市",
        "code": "620700000000",
        "key": "Z"
      },
      {
        "name": "漳州市",
        "code": "350600000000",
        "key": "Z"
      },
      // {
      //   "name": "长子县",
      //   "key": "Z"
      // }
      // ,

      // {
      //   "name": "湛河区",
      //   "key": "Z"
      // }
      // ,
      {
        "name": "湛江市",
        "code": "440800000000",
        "key": "Z"
      }
      ,

      // {
      //   "name": "站前区",
      //   "key": "Z"
      // }
      // ,
      // {
      //   "name": "沾益县",
      //   "key": "Z"
      // }
      // ,
      // {
      //   "name": "诏安县",
      //   "key": "Z"
      // },
      // {
      //   "name": "召陵区",
      //   "key": "Z"
      // },
      // {
      //   "name": "昭平县",
      //   "key": "Z"
      // },
      {
        "name": "肇庆市",
        "code": "441200000000",
        "key": "Z"
      },
      {
        "name": "昭通市",
        "code": "530600000000",
        "key": "Z"
      }
      // ,
      // {
      //   "name": "赵县",
      //   "key": "Z"
      // }

    ]
  }
]

module.exports = city;